[
  [
    {
      "name": "Anastassiya Zidkova, Filip Sedlak",
      "track": "Master",
      "title": "Using Django for Genome Engineering",
      "abstract": "This talk is for people interested to see how their programming knowledge can be applied in biology research, particularly genomics.\n\nCurrently, various technologies allow to change genetic information. Among these technologies, CRISPR is the most efficient and safe. \n\nCRISPR contains sequence of 20 letters and it is searching for match in DNA (think of it as a very long string). If it succeeds, then DNA is damaged by the cut.\nThis ability can be used  for targeted genome editing, where regions of interest can be changed.\n\nIn order to change DNA at the right place, scientists need to design the sequence which would match the target DNA.\n\nThe designed sequence shouldn't match anywhere else in the genome. Since this is biology, things are not perfect. The sequences may match even if there are a few mismatched letters. When we identify the candidate sequences, the most computationally intensive part is to look for places in the whole genome where the candidate could at least partially match.\n\nOur tool for designing such sequences is written in Python, using Django and Berkeley DB. For one analysis, we run tens of millions queries against a database of 700 million sites in genome.",
      "bio": "Anastassiya Zidkova has background in human genetics. During her PhD, she got interested in data analysis using R. She then had postdoc in bioinformatics, where she was doing genetic data analysis using python and R. Currently, she is working in MSD IT GIC on projects in bioinformatics and knowledge engineering areas.\n\nFilip Sedlak is a software engineer at the pharmaceutical company MSD. His background is in chemical informatics and now focuses on knowledge management and bioinformatics.",
      "company": "MSD IT GIC",
      "twitter": "AnastassiyaZidk",
      "github": "anastazie",
      "avatar": "anastassiya_zidkova.jpg",
      "time": "11:30"
    },
    {
      "name": "Michal Hořejšek",
      "track": "Practical",
      "title": "Testing with pytest",
      "abstract": "You can like it or not, setUp and tearDown is not enough. Not mentioning testing apps with databases or similar dependencies. With these apps you need to somehow manage fixtures. Classic unittest library has nothing to help you with. Luckily there is much better test library called pytest. I will show you why this library is so cool and why you should use it.",
      "bio": "Vedoucí vývoje převážně Pythonistů, se zájmem také o JavaScript a funkcionální svět Haskellu.",
      "company": "Seznam.cz",
      "twitter": "horejsek",
      "github": "horejsek",
      "avatar": "michal_horejsek.jpg",
      "time": "11:30"
    }
  ], [
    {
      "name": "Piotr Dyba",
      "track": "Master",
      "title": "Python, Flask and modern peripherals",
      "abstract": "Auto-scrolling sites, glance-following ads, and gesture friendly web pages are coming!\n\nOver the last few years three products emerged that enable interaction with computer in a new way: Myo Armband, Leap Motion Controller and EyeTribe. The Myo Armband is a device that uses the electrical activity in your muscles to wirelessly control your computer, phone, and tablet, which is especially useful when your hands are “tied” or dirty. This device will be used to navigate through the presentation. The Leap Motion Controller tracks both hands in front of the screen. From a web developer’s perspective, both devices allows us to use gestures, previously restricted to touch devices, on desktops. EyeTribe is an affordable eye-tracking device.\n\nThe talk will briefly cover setting up SDKs and python wrappers, and then focus on possible uses in daily life, business and, of course, web app development. Code examples will be included. In addition, the trade-offs between processing this new type of input data in the client versus processing input on the server will be discussed.",
      "bio": "Piotr's adventure with Python programming has started in September 2014, when he decided to convert from photography. Three months later he got hired by an amazing company STX Next that acknowledged his quick learning skills. He is also a junior mentor at PyLadies Poland. Beyond the 'Pythoning' he has over six years of work experience as the photojournalist, war photographer and local head of photography in one of the largest European publishing house.",
      "company": "STX Next",
      "twitter": "dybacompl",
      "github": "pdyba",
      "avatar": "piotr_dyba.jpg",
      "time": "12:20"
    },
    {
      "name": "Svetlana Margetova",
      "track": "Practical",
      "title": "Push notifications with Django",
      "abstract": "How to use Django for backend for mobile  app. How to create models and rest api with django rest framework according to mobile approach. How to support mobile specific requirements in Django, such as push notifications, mobile payments, rendering data to tablets, qr codes and more.",
      "bio": "I am Django programmer :)",
      "company": "http://margetova.eu/#/form/whoyouare",
      "twitter": "Mandragora258",
      "github": "SvetlanaM",
      "avatar": "svetlana_margetova.jpg",
      "time": "12:20"
    }
  ], [
    {
      "name": "Jessica Rose",
      "track": "Master",
      "title": "Build Newbies, Ship a Better Tech Community",
      "abstract": "Not happy with the face of your local tech scene? The fastest way to shape your local community is to teach or support enthusiastic newbies. While we’ll look at some of the great mentorship and teaching programs focused on the Django and Python communities, you don’t have to limit yourself to existing programs to start helping out. We’ll look at field tested routes to support new programmers that fit a range of different commitment levels. With enough of us helping out, we can change the face of our industry, as well as our local tech communities.",
      "bio": "Jessica Rose is a self-taught technologist obsessed with fostering equal access to technical education and growing amazing developer communities. She's founded Open Code, co-founded Trans*Code and is always interested in hearing about new projects. American born and based in England, she loves fancy cakes and simple coffee.",
      "company": "DreamFactory",
      "twitter": "jesslynnrose",
      "github": "jessrose",
      "avatar": "jessiva_rose.jpg",
      "time": "14:20"
    },
    {
      "name": "Elyézer Rezende",
      "track": "Practical",
      "title": "Python talking about Python",
      "abstract": "Let's explore some of the introspection features that Python offers. As an example let's build a tool that will extract test docstrings and generate a report.\n\nIn this talk you will discover or remember some features of the ast and inspect modules and use some of their features to build a working report generator of tests docstrings.",
      "bio": "A Brazilian, quality engineer, developer and podcaster that first discovered Python on 2008 and fall in love. Then started to learn and explore Python's features. At Dec 2013 joined Red Hat where can do Python every day.",
      "company": "Red Hat",
      "twitter": "elyezer",
      "github": "elyezer",
      "avatar": "elyezer_rezende.jpg",
      "time": "14:20"
    }
  ], [
    {
      "name": "Radomir Dopieralski",
      "track": "Master",
      "title": "Magical Attributes",
      "abstract": "Have you ever wondered about what all those \"__something__\" methods are for in Python and how they work exactly? Did you need to define how an operator works on your objects, or how the loops iterate over them? Have you heard that you shouldn't use destructors in Python, and wondered why? This talk will go through all the common magical attribute names, and explain, with examples, how they work and what they are useful for.\n\nNote to organizers:\nThis will be an upgraded version of the talk I gave on Europython: https://www.youtube.com/watch?v=rj4mf5aNhh0",
      "bio": "A Python programmer since 2005, working on variety of Open Source projects, such as MoinMoin, Hatta Wiki, Ralph, and OpenStack. A founding member of the Nigmalabs hackerspace. Plays tinwhistle horribly.",
      "company": "Red Hat",
      "twitter": "deshipu",
      "github": "deshipu",
      "avatar": "radomir_dopieralski.jpg",
      "time": "15:10"
    },
    {
      "name": "Valentina Mukhamedzhanova",
      "track": "Practical",
      "title": "Debugging a Linux distribution component",
      "abstract": "Many crucial components of modern linux distributions are written in Python. Would you like to learn a few tricks for debugging them? \n\nPython comes bundled with a rich library of modules including a debugger and several profilers, which makes it possible to use them even in very restricted environments (for example, an operating system installer). Other tools such as pudb, available as third-party packages, provide even more comfortable experience. Finally, there is a number of powerful general-purpose low-level debugging instruments, such as strace and gdb.\n\nWe'll take a close look at these handy tools and techniques for effective debugging of a Python (and not only Python) program.",
      "bio": "I'm a Software Engineer at Red Hat working on Yum package manager and its \"dandified\" fork - DNF. I'm a Linux, Python, and open-source enthusiast.",
      "company": "Red Hat",
      "twitter": "umirra",
      "github": "megaumi",
      "avatar": "valentina_mukhamedzhanova.png",
      "time": "15:10"
    }
  ], [
    {
      "name": "Jarka Schovancová",
      "track": "Master",
      "title": "Python for particle hunters",
      "abstract": "Have you ever wondered how we can use Python to study phenomena on a sub-atomic scale in the coolest place in the Universe known to the mankind? Do you know you can contribute to furthering research in the fundamental physics? Take part!",
      "bio": "",
      "company": "CERN",
      "twitter": "jschovan",
      "github": "jschovan",
      "avatar": "jarka_schovancova.jpg",
      "time": "16:30"
    },
    {
      "name": "Jan Čermák",
      "track": "Practical",
      "title": "Running Python on embedded systems",
      "abstract": "Nowadays we can not only meet Python on PCs and servers but even on many other platforms, including tiny 8-bit chips. You will learn something about Python on embedded devices, ranging from lightweight implementations of Python language to full-blown CPython running on single-board computers or routers.\n\nThe second part of the presentation will focus on pitfalls of cross-compilation of Python and 3rd party packages when a native compiler is not available on the target device.",
      "bio": "I work as an R&D programmer in the CZ.NIC Labs. Aside from developing web applications in Django, I maintain the ecosystem of OpenWrt packages and pioneer the idea of having Python as the engine for router's configuration GUI. I split my free time between playing with various hackable devices, enjoying live music gigs and cooking (the last one being a relic of my formal chemical education).",
      "company": "CZ.NIC, z. s. p. o.",
      "twitter": "sairon",
      "github": "sairon",
      "avatar": "jan_cermak.jpg",
      "time": "16:30"
    }
  ], [
    {
      "name": "Viktor Stískala",
      "track": "Master",
      "title": "What can developers learn from bankers",
      "abstract": "Companies in the financial sector doesn't have to be boring. We strive to tear down stereotypes and bring people even easier method of payment. Cooperation with people with years of experience from the bank brought us a completely different perspective and inspiration in many ways during development.\n\nIn this talk I would like to summarize what we have learned during development of the scoring system from scratch, what problems we encountered and why I think that Python plus Django was the right choice for an extensive project.\n\nYou will learn how it's like to have a person from a different sector in the same team, what tools we use for parallel evaluation of a large number of scoring criteria and why it's important to maintain a high quality logs.",
      "bio": "Viktor is CTO at Twisto which is a technology company providing consumer payment and credit services. He is responsible for the whole platform development, including API and customer credit scoring as well as for leading a team of developers.\n\nHe has years of experience with web application development and Python is his language of first choice for at least the past 5 years.",
      "company": "Twisto payments a.s.",
      "twitter": "hareevs",
      "github": "hareevs",
      "avatar": "viktor_stiskala.png",
      "time": "17:20"
    },
    {
      "name": "Věroš Kaplan, Pavel Grochal",
      "track": "Practical",
      "title": "So you have an Python app and now what?",
      "abstract": "So you have prepared a new shiny Python/Django application and you want to deploy it to the real world.\n\nTalk about miscellaneous aspects of Python applications from the Ops view. This topic includes reproducible deployment and upgrading, together with related services like Celery, etc. Don't forget relation with config-management tools like Puppet and Ansible, backup operations and possibly others not-so-fancy-but-needed ops tools.",
      "bio": "Věroš used to be Python developer but now he works mostly as operations guy. He believes in DevOps and OpenSource movements.\n\nHe works as open-source consultant for Inuits (whatever it means) in Brno.",
      "company": "Inuits",
      "twitter": "verosk",
      "github": "verosk",
      "avatar": "veros_kaplan.jpg",
      "time": "17:20"
    }
  ]
]
